GopalSaraf/Practicals/PSDL/include/proc/pic18f86j72.inc
// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0F6Fh
// bitfield definitions
LCDDATA9_LCDDATA9_POSN                   equ 0000h
LCDDATA9_LCDDATA9_POSITION               equ 0000h
LCDDATA9_LCDDATA9_SIZE                   equ 0008h
LCDDATA9_LCDDATA9_LENGTH                 equ 0008h
LCDDATA9_LCDDATA9_MASK                   equ 00FFh
LCDDATA9_S24C1_POSN                      equ 0000h
LCDDATA9_S24C1_POSITION                  equ 0000h
LCDDATA9_S24C1_SIZE                      equ 0001h
LCDDATA9_S24C1_LENGTH                    equ 0001h
LCDDATA9_S24C1_MASK                      equ 0001h
LCDDATA9_S25C1_POSN                      equ 0001h
LCDDATA9_S25C1_POSITION                  equ 0001h
LCDDATA9_S25C1_SIZE                      equ 0001h
LCDDATA9_S25C1_LENGTH                    equ 0001h
LCDDATA9_S25C1_MASK                      equ 0002h
LCDDATA9_S26C1_POSN                      equ 0002h
LCDDATA9_S26C1_POSITION                  equ 0002h
LCDDATA9_S26C1_SIZE                      equ 0001h
LCDDATA9_S26C1_LENGTH                    equ 0001h
LCDDATA9_S26C1_MASK                      equ 0004h
LCDDATA9_S27C1_POSN                      equ 0003h
LCDDATA9_S27C1_POSITION                  equ 0003h
LCDDATA9_S27C1_SIZE                      equ 0001h
LCDDATA9_S27C1_LENGTH                    equ 0001h
LCDDATA9_S27C1_MASK                      equ 0008h
LCDDATA9_S28C1_POSN                      equ 0004h
LCDDATA9_S28C1_POSITION                  equ 0004h
LCDDATA9_S28C1_SIZE                      equ 0001h
LCDDATA9_S28C1_LENGTH                    equ 0001h
LCDDATA9_S28C1_MASK                      equ 0010h
LCDDATA9_S29C1_POSN                      equ 0005h
LCDDATA9_S29C1_POSITION                  equ 0005h
LCDDATA9_S29C1_SIZE                      equ 0001h
LCDDATA9_S29C1_LENGTH                    equ 0001h
LCDDATA9_S29C1_MASK                      equ 0020h
LCDDATA9_S30C1_POSN                      equ 0006h
LCDDATA9_S30C1_POSITION                  equ 0006h
LCDDATA9_S30C1_SIZE                      equ 0001h
LCDDATA9_S30C1_LENGTH                    equ 0001h
LCDDATA9_S30C1_MASK                      equ 0040h
LCDDATA9_S31C1_POSN                      equ 0007h
LCDDATA9_S31C1_POSITION                  equ 0007h
LCDDATA9_S31C1_SIZE                      equ 0001h
LCDDATA9_S31C1_LENGTH                    equ 0001h
LCDDATA9_S31C1_MASK                      equ 0080h
LCDDATA9_SEG24COM1_POSN                  equ 0000h
LCDDATA9_SEG24COM1_POSITION              equ 0000h
LCDDATA9_SEG24COM1_SIZE                  equ 0001h
LCDDATA9_SEG24COM1_LENGTH                equ 0001h
LCDDATA9_SEG24COM1_MASK                  equ 0001h
LCDDATA9_SEG25COM1_POSN                  equ 0001h
LCDDATA9_SEG25COM1_POSITION              equ 0001h
LCDDATA9_SEG25COM1_SIZE                  equ 0001h
LCDDATA9_SEG25COM1_LENGTH                equ 0001h
LCDDATA9_SEG25COM1_MASK                  equ 0002h
LCDDATA9_SEG26COM1_POSN                  equ 0002h
LCDDATA9_SEG26COM1_POSITION              equ 0002h
LCDDATA9_SEG26COM1_SIZE                  equ 0001h
LCDDATA9_SEG26COM1_LENGTH                equ 0001h
LCDDATA9_SEG26COM1_MASK                  equ 0004h
LCDDATA9_SEG27COM1_POSN                  equ 0003h
LCDDATA9_SEG27COM1_POSITION              equ 0003h
LCDDATA9_SEG27COM1_SIZE                  equ 0001h
LCDDATA9_SEG27COM1_LENGTH                equ 0001h
LCDDATA9_SEG27COM1_MASK                  equ 0008h
LCDDATA9_SEG28COM1_POSN                  equ 0004h
LCDDATA9_SEG28COM1_POSITION              equ 0004h
LCDDATA9_SEG28COM1_SIZE                  equ 0001h
LCDDATA9_SEG28COM1_LENGTH                equ 0001h
LCDDATA9_SEG28COM1_MASK                  equ 0010h
LCDDATA9_SEG29COM1_POSN                  equ 0005h
LCDDATA9_SEG29COM1_POSITION              equ 0005h
LCDDATA9_SEG29COM1_SIZE                  equ 0001h
LCDDATA9_SEG29COM1_LENGTH                equ 0001h
LCDDATA9_SEG29COM1_MASK                  equ 0020h
LCDDATA9_SEG30COM1_POSN                  equ 0006h
LCDDATA9_SEG30COM1_POSITION              equ 0006h
LCDDATA9_SEG30COM1_SIZE                  equ 0001h
LCDDATA9_SEG30COM1_LENGTH                equ 0001h
LCDDATA9_SEG30COM1_MASK                  equ 0040h
LCDDATA9_SEG31COM1_POSN                  equ 0007h
LCDDATA9_SEG31COM1_POSITION              equ 0007h
LCDDATA9_SEG31COM1_SIZE                  equ 0001h
LCDDATA9_SEG31COM1_LENGTH                equ 0001h
LCDDATA9_SEG31COM1_MASK                  equ 0080h

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 0F70h
// bitfield definitions
LCDDATA10_LCDDATA10_POSN                 equ 0000h
LCDDATA10_LCDDATA10_POSITION             equ 0000h
LCDDATA10_LCDDATA10_SIZE                 equ 0008h
LCDDATA10_LCDDATA10_LENGTH               equ 0008h
LCDDATA10_LCDDATA10_MASK                 equ 00FFh
LCDDATA10_S32C1_POSN                     equ 0000h
LCDDATA10_S32C1_POSITION                 equ 0000h
LCDDATA10_S32C1_SIZE                     equ 0001h
LCDDATA10_S32C1_LENGTH                   equ 0001h
LCDDATA10_S32C1_MASK                     equ 0001h
LCDDATA10_SEG32COM1_POSN                 equ 0000h
LCDDATA10_SEG32COM1_POSITION             equ 0000h
LCDDATA10_SEG32COM1_SIZE                 equ 0001h
LCDDATA10_SEG32COM1_LENGTH               equ 0001h
LCDDATA10_SEG32COM1_MASK                 equ 0001h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 0F72h
// bitfield definitions
LCDDATA12_LCDDATA12_POSN                 equ 0000h
LCDDATA12_LCDDATA12_POSITION             equ 0000h
LCDDATA12_LCDDATA12_SIZE                 equ 0008h
LCDDATA12_LCDDATA12_LENGTH               equ 0008h
LCDDATA12_LCDDATA12_MASK                 equ 00FFh
LCDDATA12_S00C2_POSN                     equ 0000h
LCDDATA12_S00C2_POSITION                 equ 0000h
LCDDATA12_S00C2_SIZE                     equ 0001h
LCDDATA12_S00C2_LENGTH                   equ 0001h
LCDDATA12_S00C2_MASK                     equ 0001h
LCDDATA12_S01C2_POSN                     equ 0001h
LCDDATA12_S01C2_POSITION                 equ 0001h
LCDDATA12_S01C2_SIZE                     equ 0001h
LCDDATA12_S01C2_LENGTH                   equ 0001h
LCDDATA12_S01C2_MASK                     equ 0002h
LCDDATA12_S02C2_POSN                     equ 0002h
LCDDATA12_S02C2_POSITION                 equ 0002h
LCDDATA12_S02C2_SIZE                     equ 0001h
LCDDATA12_S02C2_LENGTH                   equ 0001h
LCDDATA12_S02C2_MASK                     equ 0004h
LCDDATA12_S03C2_POSN                     equ 0003h
LCDDATA12_S03C2_POSITION                 equ 0003h
LCDDATA12_S03C2_SIZE                     equ 0001h
LCDDATA12_S03C2_LENGTH                   equ 0001h
LCDDATA12_S03C2_MASK                     equ 0008h
LCDDATA12_S04C2_POSN                     equ 0004h
LCDDATA12_S04C2_POSITION                 equ 0004h
LCDDATA12_S04C2_SIZE                     equ 0001h
LCDDATA12_S04C2_LENGTH                   equ 0001h
LCDDATA12_S04C2_MASK                     equ 0010h
LCDDATA12_S05C2_POSN                     equ 0005h
LCDDATA12_S05C2_POSITION                 equ 0005h
LCDDATA12_S05C2_SIZE                     equ 0001h
LCDDATA12_S05C2_LENGTH                   equ 0001h
LCDDATA12_S05C2_MASK                     equ 0020h
LCDDATA12_S06C2_POSN                     equ 0006h
LCDDATA12_S06C2_POSITION                 equ 0006h
LCDDATA12_S06C2_SIZE                     equ 0001h
LCDDATA12_S06C2_LENGTH                   equ 0001h
LCDDATA12_S06C2_MASK                     equ 0040h
LCDDATA12_S07C2_POSN                     equ 0007h
LCDDATA12_S07C2_POSITION                 equ 0007h
LCDDATA12_S07C2_SIZE                     equ 0001h
LCDDATA12_S07C2_LENGTH                   equ 0001h
LCDDATA12_S07C2_MASK                     equ 0080h
LCDDATA12_SEG0COM2_POSN                  equ 0000h
LCDDATA12_SEG0COM2_POSITION              equ 0000h
LCDDATA12_SEG0COM2_SIZE                  equ 0001h
LCDDATA12_SEG0COM2_LENGTH                equ 0001h
LCDDATA12_SEG0COM2_MASK                  equ 0001h
LCDDATA12_SEG1COM2_POSN                  equ 0001h
LCDDATA12_SEG1COM2_POSITION              equ 0001h
LCDDATA12_SEG1COM2_SIZE                  equ 0001h
LCDDATA12_SEG1COM2_LENGTH                equ 0001h
LCDDATA12_SEG1COM2_MASK                  equ 0002h
LCDDATA12_SEG2COM2_POSN                  equ 0002h
LCDDATA12_SEG2COM2_POSITION              equ 0002h
LCDDATA12_SEG2COM2_SIZE                  equ 0001h
LCDDATA12_SEG2COM2_LENGTH                equ 0001h
LCDDATA12_SEG2COM2_MASK                  equ 0004h
LCDDATA12_SEG3COM2_POSN                  equ 0003h
LCDDATA12_SEG3COM2_POSITION              equ 0003h
LCDDATA12_SEG3COM2_SIZE                  equ 0001h
LCDDATA12_SEG3COM2_LENGTH                equ 0001h
LCDDATA12_SEG3COM2_MASK                  equ 0008h
LCDDATA12_SEG4COM2_POSN                  equ 0004h
LCDDATA12_SEG4COM2_POSITION              equ 0004h
LCDDATA12_SEG4COM2_SIZE                  equ 0001h
LCDDATA12_SEG4COM2_LENGTH                equ 0001h
LCDDATA12_SEG4COM2_MASK                  equ 0010h
LCDDATA12_SEG5COM2_POSN                  equ 0005h
LCDDATA12_SEG5COM2_POSITION              equ 0005h
LCDDATA12_SEG5COM2_SIZE                  equ 0001h
LCDDATA12_SEG5COM2_LENGTH                equ 0001h
LCDDATA12_SEG5COM2_MASK                  equ 0020h
LCDDATA12_SEG6COM2_POSN                  equ 0006h
LCDDATA12_SEG6COM2_POSITION              equ 0006h
LCDDATA12_SEG6COM2_SIZE                  equ 0001h
LCDDATA12_SEG6COM2_LENGTH                equ 0001h
LCDDATA12_SEG6COM2_MASK                  equ 0040h
LCDDATA12_SEG7COM2_POSN                  equ 0007h
LCDDATA12_SEG7COM2_POSITION              equ 0007h
LCDDATA12_SEG7COM2_SIZE                  equ 0001h
LCDDATA12_SEG7COM2_LENGTH                equ 0001h
LCDDATA12_SEG7COM2_MASK                  equ 0080h
LCDDATA12_S0C2_POSN                      equ 0000h
LCDDATA12_S0C2_POSITION                  equ 0000h
LCDDATA12_S0C2_SIZE                      equ 0001h
LCDDATA12_S0C2_LENGTH                    equ 0001h
LCDDATA12_S0C2_MASK                      equ 0001h
LCDDATA12_S1C2_POSN                      equ 0001h
LCDDATA12_S1C2_POSITION                  equ 0001h
LCDDATA12_S1C2_SIZE                      equ 0001h
LCDDATA12_S1C2_LENGTH                    equ 0001h
LCDDATA12_S1C2_MASK                      equ 0002h
LCDDATA12_S2C2_POSN                      equ 0002h
LCDDATA12_S2C2_POSITION                  equ 0002h
LCDDATA12_S2C2_SIZE                      equ 0001h
LCDDATA12_S2C2_LENGTH                    equ 0001h
LCDDATA12_S2C2_MASK                      equ 0004h
LCDDATA12_S3C2_POSN                      equ 0003h
LCDDATA12_S3C2_POSITION                  equ 0003h
LCDDATA12_S3C2_SIZE                      equ 0001h
LCDDATA12_S3C2_LENGTH                    equ 0001h
LCDDATA12_S3C2_MASK                      equ 0008h
LCDDATA12_S4C2_POSN                      equ 0004h
LCDDATA12_S4C2_POSITION                  equ 0004h
LCDDATA12_S4C2_SIZE                      equ 0001h
LCDDATA12_S4C2_LENGTH                    equ 0001h
LCDDATA12_S4C2_MASK                      equ 0010h
LCDDATA12_S5C2_POSN                      equ 0005h
LCDDATA12_S5C2_POSITION                  equ 0005h
LCDDATA12_S5C2_SIZE                      equ 0001h
LCDDATA12_S5C2_LENGTH                    equ 0001h
LCDDATA12_S5C2_MASK                      equ 0020h
LCDDATA12_S6C2_POSN                      equ 0006h
LCDDATA12_S6C2_POSITION                  equ 0006h
LCDDATA12_S6C2_SIZE                      equ 0001h
LCDDATA12_S6C2_LENGTH                    equ 0001h
LCDDATA12_S6C2_MASK                      equ 0040h
LCDDATA12_S7C2_POSN                      equ 0007h
LCDDATA12_S7C2_POSITION                  equ 0007h
LCDDATA12_S7C2_SIZE                      equ 0001h
LCDDATA12_S7C2_LENGTH                    equ 0001h
LCDDATA12_S7C2_MASK                      equ 0080h
LCDDATA12_SSPM012_POSN                   equ 0000h
LCDDATA12_SSPM012_POSITION               equ 0000h
LCDDATA12_SSPM012_SIZE                   equ 0001h
LCDDATA12_SSPM012_LENGTH                 equ 0001h
LCDDATA12_SSPM012_MASK                   equ 0001h
LCDDATA12_SSPM112_POSN                   equ 0001h
LCDDATA12_SSPM112_POSITION               equ 0001h
LCDDATA12_SSPM112_SIZE                   equ 0001h
LCDDATA12_SSPM112_LENGTH                 equ 0001h
LCDDATA12_SSPM112_MASK                   equ 0002h
LCDDATA12_SSPM212_POSN                   equ 0002h
LCDDATA12_SSPM212_POSITION               equ 0002h
LCDDATA12_SSPM212_SIZE                   equ 0001h
LCDDATA12_SSPM212_LENGTH                 equ 0001h
LCDDATA12_SSPM212_MASK                   equ 0004h
LCDDATA12_SSPM312_POSN                   equ 0003h
LCDDATA12_SSPM312_POSITION               equ 0003h
LCDDATA12_SSPM312_SIZE                   equ 0001h
LCDDATA12_SSPM312_LENGTH                 equ 0001h
LCDDATA12_SSPM312_MASK                   equ 0008h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0F73h
// bitfield definitions
LCDDATA13_LCDDATA13_POSN                 equ 0000h
LCDDATA13_LCDDATA13_POSITION             equ 0000h
LCDDATA13_LCDDATA13_SIZE                 equ 0008h
LCDDATA13_LCDDATA13_LENGTH               equ 0008h
LCDDATA13_LCDDATA13_MASK                 equ 00FFh
LCDDATA13_S8C2_POSN                      equ 0000h
LCDDATA13_S8C2_POSITION                  equ 0000h
LCDDATA13_S8C2_SIZE                      equ 0001h
LCDDATA13_S8C2_LENGTH                    equ 0001h
LCDDATA13_S8C2_MASK                      equ 0001h
LCDDATA13_S9C2_POSN                      equ 0001h
LCDDATA13_S9C2_POSITION                  equ 0001h
LCDDATA13_S9C2_SIZE                      equ 0001h
LCDDATA13_S9C2_LENGTH                    equ 0001h
LCDDATA13_S9C2_MASK                      equ 0002h
LCDDATA13_S10C2_POSN                     equ 0002h
LCDDATA13_S10C2_POSITION                 equ 0002h
LCDDATA13_S10C2_SIZE                     equ 0001h
LCDDATA13_S10C2_LENGTH                   equ 0001h
LCDDATA13_S10C2_MASK                     equ 0004h
LCDDATA13_S11C2_POSN                     equ 0003h
LCDDATA13_S11C2_POSITION                 equ 0003h
LCDDATA13_S11C2_SIZE                     equ 0001h
LCDDATA13_S11C2_LENGTH                   equ 0001h
LCDDATA13_S11C2_MASK                     equ 0008h
LCDDATA13_S12C2_POSN                     equ 0004h
LCDDATA13_S12C2_POSITION                 equ 0004h
LCDDATA13_S12C2_SIZE                     equ 0001h
LCDDATA13_S12C2_LENGTH                   equ 0001h
LCDDATA13_S12C2_MASK                     equ 0010h
LCDDATA13_S13C2_POSN                     equ 0005h
LCDDATA13_S13C2_POSITION                 equ 0005h
LCDDATA13_S13C2_SIZE                     equ 0001h
LCDDATA13_S13C2_LENGTH                   equ 0001h
LCDDATA13_S13C2_MASK                     equ 0020h
LCDDATA13_S14C2_POSN                     equ 0006h
LCDDATA13_S14C2_POSITION                 equ 0006h
LCDDATA13_S14C2_SIZE                     equ 0001h
LCDDATA13_S14C2_LENGTH                   equ 0001h
LCDDATA13_S14C2_MASK                     equ 0040h
LCDDATA13_S15C2_POSN                     equ 0007h
LCDDATA13_S15C2_POSITION                 equ 0007h
LCDDATA13_S15C2_SIZE                     equ 0001h
LCDDATA13_S15C2_LENGTH                   equ 0001h
LCDDATA13_S15C2_MASK                     equ 0080h
LCDDATA13_SEG8COM2_POSN                  equ 0000h
LCDDATA13_SEG8COM2_POSITION              equ 0000h
LCDDATA13_SEG8COM2_SIZE                  equ 0001h
LCDDATA13_SEG8COM2_LENGTH                equ 0001h
LCDDATA13_SEG8COM2_MASK                  equ 0001h
LCDDATA13_SEG9COM2_POSN                  equ 0001h
LCDDATA13_SEG9COM2_POSITION              equ 0001h
LCDDATA13_SEG9COM2_SIZE                  equ 0001h
LCDDATA13_SEG9COM2_LENGTH                equ 0001h
LCDDATA13_SEG9COM2_MASK                  equ 0002h
LCDDATA13_SEG10COM2_POSN                 equ 0002h
LCDDATA13_SEG10COM2_POSITION             equ 0002h
LCDDATA13_SEG10COM2_SIZE                 equ 0001h
LCDDATA13_SEG10COM2_LENGTH               equ 0001h
LCDDATA13_SEG10COM2_MASK                 equ 0004h
LCDDATA13_SEG11COM2_POSN                 equ 0003h
LCDDATA13_SEG11COM2_POSITION             equ 0003h
LCDDATA13_SEG11COM2_SIZE                 equ 0001h
LCDDATA13_SEG11COM2_LENGTH               equ 0001h
LCDDATA13_SEG11COM2_MASK                 equ 0008h
LCDDATA13_SEG12COM2_POSN                 equ 0004h
LCDDATA13_SEG12COM2_POSITION             equ 0004h
LCDDATA13_SEG12COM2_SIZE                 equ 0001h
LCDDATA13_SEG12COM2_LENGTH               equ 0001h
LCDDATA13_SEG12COM2_MASK                 equ 0010h
LCDDATA13_SEG13COM2_POSN                 equ 0005h
LCDDATA13_SEG13COM2_POSITION             equ 0005h
LCDDATA13_SEG13COM2_SIZE                 equ 0001h
LCDDATA13_SEG13COM2_LENGTH               equ 0001h
LCDDATA13_SEG13COM2_MASK                 equ 0020h
LCDDATA13_SEG14COM2_POSN                 equ 0006h
LCDDATA13_SEG14COM2_POSITION             equ 0006h
LCDDATA13_SEG14COM2_SIZE                 equ 0001h
LCDDATA13_SEG14COM2_LENGTH               equ 0001h
LCDDATA13_SEG14COM2_MASK                 equ 0040h
LCDDATA13_SEG15COM2_POSN                 equ 0007h
LCDDATA13_SEG15COM2_POSITION             equ 0007h
LCDDATA13_SEG15COM2_SIZE                 equ 0001h
LCDDATA13_SEG15COM2_LENGTH               equ 0001h
LCDDATA13_SEG15COM2_MASK                 equ 0080h
LCDDATA13_S08C2_POSN                     equ 0000h
LCDDATA13_S08C2_POSITION                 equ 0000h
LCDDATA13_S08C2_SIZE                     equ 0001h
LCDDATA13_S08C2_LENGTH                   equ 0001h
LCDDATA13_S08C2_MASK                     equ 0001h
LCDDATA13_S09C2_POSN                     equ 0001h
LCDDATA13_S09C2_POSITION                 equ 0001h
LCDDATA13_S09C2_SIZE                     equ 0001h
LCDDATA13_S09C2_LENGTH                   equ 0001h
LCDDATA13_S09C2_MASK                     equ 0002h

